streetartist/AstroInk/sdkconfig.defaults
# ============================================================
# AstroInk default sdkconfig — ESP32-S3-N16R8
# (16MB QUAD flash + 8MB OCTAL PSRAM)
# ============================================================

CONFIG_IDF_TARGET="esp32s3"

# ---- Flash: 16MB, QIO @ 80MHz ----
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# ---- PSRAM: octal SPI @ 80MHz ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
# Let malloc() fall back to PSRAM for large buffers (framebuffers, VM heaps)
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ---- Custom 16MB partition table ----
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- FreeRTOS ----
CONFIG_FREERTOS_HZ=1000

# ---- Main task stack (App Manager / Launcher needs headroom) ----
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ---- Logging ----
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# NOTE: WiFi is available by default. Bluetooth (NimBLE) will be enabled
# in a later phase to keep the P0 build lean; add when needed:
#   CONFIG_BT_ENABLED=y
#   CONFIG_BT_NIMBLE_ENABLED=y
